# ukol-10: Zaměstnanci a Projekty

## Zadání 1

Uvažuj, že zpracováváš analýzu pro softwarovou firmu. Firma má kanceláře v Praze, Plzni a Liberci. Seznam zaměstnanců pro jednotlivé kanceláře najdeš v souborech [zam_praha.csv](https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/zam_praha.csv), [zam_plzeň.csv](https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/zam_plzeň.csv) a [zam_liberec.csv](https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/zam_liberec.csv).

In [1]:
import pandas

In [2]:
zam_praha = pandas.read_csv("https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/zam_praha.csv")
zam_plzen = pandas.read_csv("https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/zam_plze%C5%88.csv")
zam_liberec = pandas.read_csv("https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/zam_liberec.csv")

* Načti data o zaměstnancích z CSV souborů do tabulek (DataFrame). Ke každé tabulce přidej nový sloupec `mesto`, které bude obsahovat informaci o tom, ve kterém městě zaměstnanec pracuje.

In [3]:
zam_praha["mesto"] = "Praha"
zam_plzen["mesto"] = "Plzeň"
zam_liberec["mesto"] = "Liberec"

zam_praha.head()

      jmeno prijimeni   telefonni_cislo  cislo_zamestnance  mesto
0     Brian      Hall  +421 949 656 098                 30  Praha
1     Marta  Kolářová       730 456 163                 32  Praha
2      John   Moravec       725 092 179                 33  Praha
3  Dominika   Kopecká       722 747 626                 34  Praha
4    Marcel     Hájek  +421 902 928 669                 35  Praha

* Vytvoř novou tabulku `zamestnanci` a ulož do ní informace o všech zaměstnancích (operace `concat`).

In [4]:
zamestnanci = pandas.concat([zam_praha, zam_plzen, zam_liberec], ignore_index=True)
zamestnanci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56 entries, 0 to 55
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.3+ KB

* Ze souboru [platy_2021_02.csv](https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/platy_2021_02.csv) načti platy zaměstnanců za únor 2021. Propoj tabulku (operace `merge`) s platy a tabulku se zaměstnanci pomocí sloupce `cislo_zamestnance`.

In [5]:
platy = pandas.read_csv('platy_2021_02.csv')
platy.head()

   cislo_zamestnance     plat
0                  3  54900.0
1                  6  54800.0
2                  7  36400.0
3                  8  47900.0
4                 16  34200.0

In [6]:
platy_zamestnanci = pandas.merge(platy, zamestnanci, on="cislo_zamestnance")
platy_zamestnanci.shape

(43, 6)

* Porovnej rozměry tabulek před spojením a po spojení. Pokud nemá některý zaměstnanec plat za únor, znamená to, že v naší firmě již nepracuje.

In [7]:
print(f"{zamestnanci.shape=}")  # Pred spojenim
print(f"{platy.shape=}")  # Pred spojenim
print(f"{platy_zamestnanci.shape=}")  # Po spojeni

zamestnanci.shape=(56, 5)
platy.shape=(43, 2)
platy_zamestnanci.shape=(43, 6)

* Spočti průměrný plat zaměstnanců v jednotlivých kancelářích.

In [8]:
platy_zamestnanci.groupby("mesto")["plat"].mean()

mesto
Liberec    43775.000000
Plzeň      44792.857143
Praha      43295.238095
Name: plat, dtype: float64

---
## Zadání 2
Pokračuj ve své práci pro softwarovou firmu. Ze souboru [vykazy.csv](https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/vykazy.csv) načti informace o výkazech na projekty pro jednoho vybraného zákazníka.

* Načti data ze souboru a ulož je do tabulky.
* Proveď agregaci a zjisti celkový počet vykázaných hodin za jednotlivé projekty.

In [9]:
vykazy = pandas.read_csv("https://raw.githubusercontent.com/lutydlitatova/python-jaro-2022/main/ukoly/data/vykazy.csv")
vykazy.head()

         date  hours project  emloyee_id
0  2021-02-01    2.5     F30          13
1  2021-02-01    3.4     W05          70
2  2021-02-01    2.1     JL9          72
3  2021-02-01    5.2     F30           3
4  2021-02-01    2.4     TE1          54

In [10]:
vykazy.groupby('project')['hours'].sum()

project
F30    21.5
JL9     2.1
TE1    16.0
W05    30.5
YLI    31.0
Name: hours, dtype: float64

---

## Nepovinný bonus 1

* Ulož do proměnné počet zaměstnanců, kteří v naší firmě již nepracují.
* V rámci úspory se IT oddělení rozhodlo prověřit licence přidělené zaměstnancům, kteří ve firmě již nepracují. Vytvoř samostatnou tabulku, která obsahuje jména zaměstnanců, kteří ve firmě již nepracují. Tabulku ulož do souboru CSV.

In [11]:
platy_zamestnanci = pandas.merge(platy, zamestnanci, on="cislo_zamestnance", how="outer")
byvali_zamestnanci = platy_zamestnanci[platy_zamestnanci['plat'].isna()]
byvali_zamestnanci

    cislo_zamestnance  plat      jmeno prijimeni   telefonni_cislo    mesto
43                 35   NaN     Marcel     Hájek  +421 902 928 669    Praha
44                 53   NaN   Karolína     Short       721 589 083    Praha
45                 54   NaN   Michelle   Vlčková  +421 41 720 7806    Praha
46                 58   NaN       John    Bailey       775 021 116    Praha
47                 60   NaN    William   Shelton  +421 47 745 8219    Praha
48                 62   NaN  Miroslava    Veselá       774 029 254    Praha
49                 66   NaN     Nathan   Svoboda       728 710 923    Praha
50                 72   NaN     Robert      Říha       727 351 984    Praha
51                 10   NaN   Jindřich    Howell  +421 39 043 0948    Plzeň
52                 13   NaN  Alexander  Martinez       721 195 689    Plzeň
53                 86   NaN   Jennifer     Brown       775 545 190  Liberec
54                 88   NaN     Robert    Macias  +421 49 929 6856  Liberec
55                 99   NaN       Ivan    Bartoš       603 226 051  Liberec

In [12]:
byvali_zamestnanci.to_csv("byvali_zamestnanci.csv", index=False)

---

## Nepovinný bonus 2

Propoj tabulku s výkazy s tabulkou se zaměstnanci, kterou jsi vytvořil(a) v předchozím cvičení. 

Následně proveď statistiku vykázaných hodin za jednotlivé kanceláře, tj. spočítej celkový počet hodin vykázaný zaměstnanci jednotlivých kanceláří na projekty daného zákazníka.

In [13]:
vykazy_zamestnanci = pandas.merge(vykazy, zamestnanci, left_on="emloyee_id", right_on="cislo_zamestnance")
vykazy_zamestnanci.head()

,date,hours,project,emloyee_id,jmeno,prijimeni,telefonni_cislo,cislo_zamestnance,mesto
0,2021-02-01,2.5,F30,13,Alexander,Martinez,721 195 689,13,Plzeň
1,2021-02-01,3.4,W05,70,Dillon,Black,734 300 978,70,Praha
2,2021-02-01,2.1,JL9,72,Robert,Říha,727 351 984,72,Praha
3,2021-02-01,5.2,F30,3,Stacy,Pospíšilová,727 293 880,3,Plzeň
4,2021-02-01,2.4,TE1,54,Michelle,Vlčková,+421 41 720 7806,54,Praha

In [14]:
vykazy_zamestnanci.groupby(["project", "mesto"]).sum()[["hours"]]

                 hours
project mesto
F30     Plzeň     10.3
        Praha     11.2
JL9     Praha      2.1
TE1     Liberec   10.8
        Praha      5.2
W05     Liberec    5.4
        Praha     25.1
YLI     Liberec   11.8
        Plzeň      5.3
        Praha     13.9